/**
 * Company jt56.org
 * Created by libinqi on 13-12-6.
 */
//专线类型
exports.line_type = [
    {"id": "1", "name": "单程"},
    {"id": "2", "name": "往返"}
];

//专线承运货物类型
exports.line_goods_type = [
    {"id": "1", "name": "不限"},
    {"id": "2", "name": "普通货物"},
    {"id": "3", "name": "大件货物"},
    {"id": "4", "name": "鲜活易腐"},
    {"id": "5", "name": "危险货物"},
    {"id": "6", "name": "贵重货物"},
    {"id": "7", "name": "保温冷藏"},
    {"id": "8", "name": "搬家货物"}
];

//在途时间
exports.trans_time = [
    {"id": "1", "name": "1天"},
    {"id": "2", "name": "2天"},
    {"id": "3", "name": "3天"},
    {"id": "4", "name": "4天"},
    {"id": "5", "name": "5天"},
    {"id": "6", "name": "5天以上"}
];

//运输方式
exports.mode_transport = [
    {"id": "1", "name": "公路运输"},
    {"id": "2", "name": "海上运输"},
    {"id": "3", "name": "铁路运输"},
    {"id": "4", "name": "航空运输"},
    {"id": "5", "name": "邮件运输"},
    {"id": "6", "name": "多式联运"},
    {"id": "7", "name": "固定设施运输"},
    {"id": "8", "name": "内河运输"},
    {"id": "9", "name": "其它运输"}
];

//信息有效期
exports.validate_type = [
    {"id": "1", "name": "长期有效", "day": 3650},
    {"id": "2", "name": "1天", "day": 1},
    {"id": "3", "name": "7天", "day": 7},
    {"id": "4", "name": "15天", "day": 15},
    {"id": "5", "name": "1个月", "day": 30},
    {"id": "6", "name": "半年", "day": 182},
    {"id": "7", "name": "1年", "day": 365}
];

//货物类型
exports.goods_type = [
    {"id": "1", "name": "普货"},
    {"id": "2", "name": "重货"},
    {"id": "3", "name": "泡货"},
    {"id": "4", "name": "整车"},
    {"id": "5", "name": "零担"},
    {"id": "6", "name": "设备"},
    {"id": "7", "name": "配件"},
    {"id": "8", "name": "电瓷"},
    {"id": "9", "name": "烟叶"},
    {"id": "10", "name": "棉纱"},
    {"id": "11", "name": "显像管"},
    {"id": "12", "name": "瓷器"},
    {"id": "13", "name": "电器"},
    {"id": "14", "name": "服装"},
    {"id": "15", "name": "棉被"},
    {"id": "16", "name": "棉花"},
    {"id": "17", "name": "平板纸"},
    {"id": "18", "name": "医药"},
    {"id": "19", "name": "煤炭"},
    {"id": "20", "name": "矿产"},
    {"id": "21", "name": "钢铁"},
    {"id": "22", "name": "铁粉"},
    {"id": "23", "name": "建材"},
    {"id": "24", "name": "胶版"},
    {"id": "25", "name": "食品"},
    {"id": "26", "name": "粮食"},
    {"id": "27", "name": "饮料"},
    {"id": "28", "name": "危险品"},
    {"id": "29", "name": "烟花"},
    {"id": "30", "name": "化工"},
    {"id": "31", "name": "化肥农药"},
    {"id": "32", "name": "石油制品"},
    {"id": "33", "name": "轻工产品"},
    {"id": "34", "name": "牧产品"},
    {"id": "35", "name": "牲畜"},
    {"id": "36", "name": "渔产品"},
    {"id": "37", "name": "农产品"},
    {"id": "38", "name": "水果"},
    {"id": "39", "name": "蔬菜"},
    {"id": "40", "name": "木材"},
    {"id": "41", "name": "木方子"},
    {"id": "42", "name": "树苗"},
    {"id": "43", "name": "小竹杆"},
    {"id": "44", "name": "竹片"},
    {"id": "45", "name": "轿车"},
    {"id": "46", "name": "驾驶室"},
    {"id": "47", "name": "特种货物"},
    {"id": "48", "name": "军用品"},
    {"id": "49", "name": "超宽设备"},
    {"id": "50", "name": "件装货物"},
    {"id": "51", "name": "散装货物"},
    {"id": "52", "name": "罐装货物"},
    {"id": "53", "name": "其它"}
];

exports.vehicle_type = [
    {"id": "1", "name": "平板"},
    {"id": "2", "name": "高栏"},
    {"id": "3", "name": "高栏单桥"},
    {"id": "4", "name": "高栏双桥"},
    {"id": "5", "name": "集装箱"},
    {"id": "6", "name": "半挂"},
    {"id": "7", "name": "半封闭"},
    {"id": "8", "name": "后八轮"},
    {"id": "9", "name": "后八轮或半挂"},
    {"id": "10", "name": "后八轮或前四后八"},
    {"id": "11", "name": "前四后八"},
    {"id": "12", "name": "前四后四"},
    {"id": "13", "name": "5轮"},
    {"id": "14", "name": "9轮"},
    {"id": "15", "name": "冷藏"},
    {"id": "16", "name": "保温"},
    {"id": "17", "name": "普通"},
    {"id": "18", "name": "小车"},
    {"id": "19", "name": "零担"},
    {"id": "20", "name": "单车"},
    {"id": "21", "name": "单桥或半挂"},
    {"id": "22", "name": "低板"},
    {"id": "23", "name": "二托三"},
    {"id": "24", "name": "二托四"},
    {"id": "25", "name": "工程"},
    {"id": "26", "name": "笼子"},
    {"id": "27", "name": "平板拖"},
    {"id": "28", "name": "起重"},
    {"id": "29", "name": "全封闭"},
    {"id": "30", "name": "斯太尔"},
    {"id": "31", "name": "特种"},
    {"id": "32", "name": "危险"},
    {"id": "33", "name": "邮政"},
    {"id": "34", "name": "油罐"},
    {"id": "35", "name": "自卸"},
    {"id": "36", "name": "自由厢板"},
    {"id": "37", "name": "其它"}
];

exports.loading_time = [
    {"id": "1", "name": "随时"},
    {"id": "2", "name": "今天"},
    {"id": "3", "name": "明天"},
    {"id": "4", "name": "后天"},
    {"id": "5", "name": "至少3天后"}
];

exports.store_type=[
    {"id": "1", "name": "普通"},
    {"id": "2", "name": "综合"},
    {"id": "3", "name": "保税"},
    {"id": "4", "name": "冷藏"},
    {"id": "5", "name": "恒温"},
    {"id": "6", "name": "危险品"},
    {"id": "7", "name": "立体"},
    {"id": "8", "name": "露天"},
    {"id": "9", "name": "货架"},
    {"id": "10", "name": "液体"},
    {"id": "11", "name": "堆场"},
    {"id": "12", "name": "其它"},
];

exports.business_scope=[
    {"id": "1", "name": "自有仓库"},
    {"id": "2", "name": "租用仓库"},
];